In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [9]:
df = pd.read_csv('Data/Sales_Data.csv')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      200 non-null    object
 1   Product   200 non-null    object
 2   Price     200 non-null    int64
 3   Quantity  200 non-null    int64
dtypes: int64(2), object(2)
memory usage: 6.4+ KB

In [11]:
df.head()

         Date     Product  Price  Quantity
0  2024-02-21      Laptop   1103         1
1  2024-04-02     Monitor   1743         4
2  2024-01-15      Laptop    104         4
3  2024-03-12      Tablet   1226         1
4  2024-03-01  Smartphone   1319         1

In [12]:
df.describe()

             Price    Quantity
count   200.000000  200.000000
mean   1099.640000    2.455000
std     516.533206    1.185327
min     104.000000    1.000000
25%     734.500000    1.000000
50%    1108.000000    2.000000
75%    1522.750000    4.000000
max    1992.000000    4.000000

In [ ]:
df ['Total_Sales'] = df['Price'] * df['Quantity']

product_sales = df.groupby('Product')['Total_Sales'].sum().reset_index()

print(product_sales)

      Product  Total_Sales
0  Headphones       114237
1      Laptop       135091
2     Monitor        84571
3  Smartphone        91896
4      Tablet       113163